/* 1. Написать функцию, преобразующую число в объект. Передавая на вход число от 0 до 999, мы должны получить на выходе объект, в котором в соответствующих свойствах описаны единицы, десятки и сотни. Например, для числа 245 мы должны получить следующий объект: {‘единицы’: 5, ‘десятки’: 4, ‘сотни’: 2}. Если число превышает 999, необходимо выдать соответствующее сообщение с помощью console.log и вернуть пустой объект.




function getNumToObject(num) {
    if (num > 999 || num < 0) {
        console.log('число ' + num + ' не входит в диапазон от 0 до 999')
        return {}
    }
    
    return { 
        'единицы': num % 10,
        'десятки': Math.floor((num / 10) % 10),
        'сотни': Math.floor(num / 100)
    }
    
}

console.log(getNumToObject(9185)) */

/* 2.Продолжить работу с интернет-магазином:
2.1. В прошлом домашнем задании вы реализовали корзину на базе массивов. Какими объектами можно заменить их элементы?
2.2. Реализуйте такие объекты.
2.3. Перенести функционал подсчета корзины на объектно-ориентированную базу.
 

const basket = {
    goods: [
        {
            id_product: 789,
            product_name: 'Монитор',
            price: 11200,
            quantity: 2
        },
        {
            id_product: 790,
            product_name: 'Клавиатура',
            price: 1800,
            quantity: 5
        }
    ],
    countBasketPrice() {
        return this.goods.reduce((totalPrice, cartItem) => totalPrice + cartItem.price * cartItem.quantity, 0)
    }
}

console.log(basket.countBasketPrice()) */

