/* 1. Задать температуру в градусах по Цельсию. Вывести в alert соответствующую температуру в градусах по Фаренгейту. Подсказка: расчет идет по формуле Tf = (9 / 5) * Tc + 32, где Tf — температура по Фаренгейту, Tc — по Цельсию.

const tc = prompt('Введите температуру в градусах по Цельсию:');
const tf =  (9 / 5) * tc + 32;
alert(tf) */


/* 2.Объявить две переменные: admin и name. Записать в name строку "Василий"; Скопировать значение из name в admin. Вывести admin (должно вывестись «Василий»). */

/* let name = 'Василий'
let admin = name
console.log(admin) */

/* 3.Чему будет равно JS-выражение 1000 + "108"?
Ответ: произойдет конкатенация строк, 1000108 */

/* Самостоятельно разобраться с атрибутами тега script (async и defer). 
У async и defer есть кое-что общее: они не блокируют отрисовку страницы. Так что пользователь может просмотреть содержимое страницы и ознакомиться с ней сразу же.

Но есть и значимые различия:

async	Порядок загрузки (кто загрузится первым, тот и сработает).	Не имеет значения. Может загрузиться и выполниться до того, как страница полностью загрузится. Такое случается, если скрипты маленькие или хранятся в кеше, а документ достаточно большой.

defer	Порядок документа (как расположены в документе).	Выполняется после того, как документ загружен и обработан (ждёт), непосредственно перед DOMContentLoaded.*/